pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c

#include "hmi_driver.h"
#include "hmi_user_uart.h"
#include "cmd_queue.h"
#include "cmd_process.h"
#include "stdio.h"
#include "hw_config.h"
#include "ulitity.h"
#include "string.h"
#include "flash.h"
#include "timer.h"
#include "exti.h"
#include "stdio.h"
#include "stm32f10x.h"
#include "stm32f10x_tim.h"
#include "tft.h"
#include "malloc.h"	    


#define Start 1
#define Stop  0
#define TIME_100MS 10                                //100毫秒(10个单位)
volatile uint32  timer_tick_count = 0;               //定时器节拍
uint8  cmd_buffer[CMD_MAX_SIZE];                     //指令缓存
uint8  USART2_RX_STA=0;                              //USART2接收状态标记


uint8  Work_Page_Status = 0;              //工作页面标记
uint8  get_cmd_type;                     //获取指令类型
uint8  get_ctrl_msg;                     //获取消息的类型
uint8  get_button_state;                 //获取按钮状态
uint8  get_control_type;                 //获取控件类型
uint16 get_screen_id;                    //获取画面ID
uint16 get_control_id;                   //获取控件ID
uint32 get_value;                        //获取数值
uint8  input_buf[20];                    //键盘输入内容

int32 Pulses_counter;              // 手轮脉冲数量
uint8 first_time_power_on=0;       //掉电后第一次开机标志位
uint8 Send_cooddinate_status;      //发送坐标标记位,1:发送坐标，0：不发送
uint8 first_time_re_workpiece;     //首次进入回工件零页面
int32 Working_line;                //加工行数

int32 Pulses_num_temp;             //临时保存脉冲数量
uint8 file_name[20];               //文件名
char  Working_line_buf[10];        //保存加工行数

State state;                             //申明工作状态结构体变量
Override override;                       //声明倍率相关结构体
Speed_Control Speed;                     //声明主轴速度相关的结构体变量
Pram_Status pram_status;                 //声明设置页面相关参数的结构体变量
Control_Panel_Pram control_panel_pram;   //声明控制面板相关参数的结构体变量
Return_Workpiece return_workpiece;       //声明回工件零相关参数的结构体变量


/******************************************************************************************************/
/*!                                                                                 
*  \brief  程序入口                                                                 
*/ 
/*******************************************************************************************************/
int main()                                                                          
{  
	qsize  size = 0;          //指令长度 

	Set_System();             //配置时钟                                                                                                                                 
	Interrupts_Config();      //配置串口中断                                                                                                                             
	systicket_init();         //配置时钟节拍	
	Usart1_Init(115200);      //串口1初始化(与TFT屏通讯)
  Usart2_Init(115200);      //串口2初始化(与雕刻机通讯)
	queue_reset();            //清空串口接收缓冲区 
	TIME2_Init();             //定时器2初始化(向主机发送坐标)
	TIME3_Init();             //定时器3初始化(向主机询问坐标)
  TIME4_Init();             //定时器4初始化(计算脉冲)
	TIM_Cmd(TIM4, DISABLE);   //关闭TIM4定时器
	                                                                                               
	delay_ms(300);            //延时等待串口屏初始化完毕,必须等待300ms  
	
	Power_On_Set();                 //开机动画和参数初始化设置
		
	Setting_page_pram_get();        //设置页面相关参数值恢复（断电保存在flash）
	
  if(first_time_power_on==0)      //断电后第一次开机执行这个操作
  {
		Return_last_status();         //恢复上一次设置状态
		first_time_power_on=1;
  }
	
		
		//    特别注意
		//    MCU不要频繁向串口屏发送数据，否则串口屏的内部缓存区会满，从而导致数据丢失(缓冲区大小：标准型8K，基本型4.7K)
		//    1) 一般情况下，控制MCU向串口屏发送数据的周期大于100ms，就可以避免数据丢失的问题；
		//    2) 如果仍然有数据丢失的问题，请判断串口屏的BUSY引脚，为高时不能发送数据给串口屏。
	
	while(1)                                                                        
	{
		size = queue_find_cmd(cmd_buffer,CMD_MAX_SIZE);                  //从USART1缓冲区中获取一条指令，得到指令长度       
		if(size>0 && cmd_buffer[1]!=0x07)                                  //接收到指令 ，及判断是否为开机提示
		{                                                                           
			ProcessMessage((PCTRL_MSG)cmd_buffer, size);                   //指令分析处理 ，判断主程序进入哪个Work_Page_Status
			memset(cmd_buffer, 0, CMD_MAX_SIZE);
		} 
		
		
    if(USART2_RX_STA)                                               //串口2接收到了数据
		{
		  uart2_command_handle();                                       //数据分析		
		}


		if(state.Work_state==Start)          //显示当前处于加工状态
		{
			WorkingStatus_Starting();       
		}
		else                                 //显示当前已经停止加工
		{
			WorkingStatus_Stoped();  
		}


		switch(Work_Page_Status)
		{
		
			case Working_Page: //*********************************************************加工页面***************************************************************************************************
			{	
        		
				Spindle_and_Work_Speed_Key_Process();	           	//加工中心主轴速度和加工速度按钮处理
				if(state.Work_state==Start)                        //机器处于加工状态中
				{
					  TFT_Show_coordanate_value();			            //显示工件和机械坐标
						SetTextValue(0,21,(uchar *)file_name);        //显示正在加载的文件名			
						sprintf(Working_line_buf,"%d",Working_line);  
						SetTextValue(0,22,(uchar *)Working_line_buf); //显示加工行数，需要向主机询问
				}
				else
				{
					if(control_panel_pram.X_press)
					{
						Show_X_Coordinata();                 //计算脉冲并显示X轴坐标		
					}
					if(control_panel_pram.Y_press)
					{
					  Show_Y_Coordinata();                 //计算脉冲并显示Y轴坐标	
					}
					if(control_panel_pram.Z_press)
					{
						Show_Z_Coordinata();                 //计算脉冲并显示Z轴坐标		
					}
					if(control_panel_pram.A_press)
					{
					  Show_A_Coordinata();                 //计算脉冲并显示A轴坐标	
					}
					if(control_panel_pram.B_press)
					{
						Show_B_Coordinata();                 //计算脉冲并显示B轴坐标		
					}
				}
				
			}break;
		
		  case Setting_page:  //***********************************************************设置页面*************************************************************************************************
 		  {
	     if(pram_status.Screen_ID1_Setting_concel)          //取消按钮按下
			 {
					Return_last_status();                           //恢复上一次设置状态 
				  pram_status.Screen_ID1_Setting_concel=0;
          Work_Page_Status=Working_Page;				 
			 }		
			}
			break;
			case Save_Pram_Page:  //****************************************************提示是否保存参数设置****************************************************************************************
			{
				if(state.Work_state==Stop)                                   //停止加工
				{
					if(pram_status.Screen_ID21_Setting_Sure)                   //“确定按钮”按下
					{
						Save_Set();                                              //保存设置
						Work_Page_Status=Working_Page;
					}
					if(pram_status.Screen_ID21_Setting_concel)                 //取消按钮按下
					{
						Return_last_status();                                    //恢复上一次设置状态
						Work_Page_Status=Working_Page;					
					}	
			  }				
			}
			break;	
			case ControlPanel_Page:  //******************************************************控制面板页面*****************************************************************************************
			{
        if(state.Work_state==Stop)	                           //停止加工
				{					
					if(control_panel_pram.X_press)                        //***********************X轴选定状态******************************************************                 
					{
						if(control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button==0)
						{
							if(override.Override_num_temp_X != override.Override_num)   //倍率切换
							{	 
							   control_panel_pram.X_value_temp = control_panel_pram.X_value;
								 override.Override_num_temp_X = override.Override_num;
								 TIM4->CNT = 0;
								 Pulses_counter = 0;
							   Pulses_num_temp = 0;
							}
              Show_X_Coordinata();                 //计算脉冲并显示X轴坐标						
						}
						if(control_panel_pram.Clear_Button && control_panel_pram.All_Spindle_Clear_Button==0)    //清零按钮触发
						{
							TIM4->CNT = 0;
							Pulses_counter=0;
							Pulses_num_temp=0;
							control_panel_pram.X_value_temp=0;
							control_panel_pram.X_Pulses_counter=0;							
              X_coordinate_clear();                    //对X轴工件坐标清零	
							control_panel_pram.Clear_Button=0;						
						}
						if( control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button)  //全轴清零触发
						{
							
							Pulses_num_Clear();                    //脉冲数量清零
						  All_Workpiece_coordinate_clear();      //对所有轴工件坐标清零							
//							XYZAB_button_reset();                  //XYZAB坐标按钮复位
							control_panel_pram.All_Spindle_Clear_Button=0;
						}
						if(Send_cooddinate_status)
						{          
							Send_X_Coordinate_to_Host();          //向主机发送X轴坐标	
							Send_cooddinate_status=0;
						}
						
