pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c
									default: break;		
                 }									
						}					
					}break;   
					case 2:                                       //画面2：控制面板
					{
							Work_Page_Status=ControlPanel_Page;
							switch(get_control_id)
							{
                  case 1:                                           //清零按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                          //停止加工
										{
											control_panel_pram.Clear_Button=1;     
										}
									}break;    
                  case 2:                                             //回机械零按钮触发	
                  {
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
										}
									}break;                                     									
									case 3:								                              //倍率切换按钮触发
									{
										if(state.Work_state==Start)      //开始加工
										{
										}
										else                             //停止加工
										{
											if(get_button_state)
											{
													control_panel_pram.Override_Change_button=1;
													Override_Change_Process();     //倍率切换控制											
											}
											get_button_state=0;	
										}											
									}break;
								  case 4:                                             //主轴开关按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
										}
									}break;
			            case 5:                                              //全轴清零按钮触发
									{
                    if(state.Work_state==Start)     //开始加工
										{
										}
										else                            //停止加工
										{										
												control_panel_pram.All_Spindle_Clear_Button=1;
//												TIM_Cmd(TIM4, DISABLE);       //关闭TIM4定时器
//											  TIM_Cmd(TIM2, DISABLE);        //禁止TIM2，禁止向主机发送坐标
//						            Send_cooddinate_status=0;
										}
									}break;
									case 6:                                            //回工件零按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
											Work_Page_Status=Return_WorkPiece_Zero_Page;
											first_time_re_workpiece=1;
										}
									}break;
									case 7:                                            //坐标切换按钮触发
									{
										if(state.Work_state==Start)     //开始加工
										{
										}
										else                           //停止加工
										{
											if(get_button_state)
											{										
												  Coordinate_Change_Process();//坐标切换控制
												  get_button_state=0;
											 }
										}											
									}break;
									case 8:                                            //软限位开关按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
										}
									}break;
									case 9:                                            //安全Z按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
										}
									}break;
									case 10:                                         //跳行加工按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
											Work_Page_Status=Jump_Work_Page;
										}
									}break;
									case 11:                                          //对刀按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
											Work_Page_Status=Jump_Work_Page;
										}
									}break;
									case 12:                                         //分中按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
											Work_Page_Status=Jump_Work_Page;
										}
									}break;
									case 13:                                           //开始按钮触发
									{
										state.Work_state=Start;
										TIM_Cmd(TIM3, ENABLE);      //使能 TIM3
										TIM_Cmd(TIM4, DISABLE);      //禁止 TIM4
										SetButtonValue(2,14,0);     //停止按钮松开状态
										SetButtonValue(2,13,1);     //开始按钮按下状态										
									}break;
									case 14:                                           //停止按钮触发
									{
										state.Work_state=Stop;
										TIM_Cmd(TIM3, DISABLE);     //禁止 TIM3
										SetButtonValue(2,13,0);     //开始按钮松开状态
										SetButtonValue(2,14,1);     //停止按钮按下状态
                    if(control_panel_pram.X_press || control_panel_pram.Y_press || control_panel_pram.Z_press || control_panel_pram.A_press || control_panel_pram.B_press)
										{
										  TIM_Cmd(TIM4, ENABLE);      //使能 TIM4
										}											
									}break;
									case 15:                                            //复位按钮触发
									{
										state.Work_state=Stop;
										TIM_Cmd(TIM3, DISABLE);      //禁止 TIM3
										SetButtonValue(2,13,0);      //开始按钮松开状态
										SetButtonValue(2,14,1);      //停止按钮按下状态						
									}break;
									case 16:                                          //退出控制面板按钮触发
									{
										Work_Page_Status=Working_Page;
									}
									break;
									case 22:                                            //X轴按钮触发
									{	
										SetButtonValue(2,22,1);     //X轴保持选中状态
										TIM_Cmd(TIM4, ENABLE);      //启动TIM4定时器									
										if(control_panel_pram.X_press==0)
										{
											TIM4->CNT = control_panel_pram.X_Pulses_counter*4;
                      Pulses_counter=0;											
										}
										control_panel_pram.X_press=1;
										control_panel_pram.Y_press=0;
										control_panel_pram.Z_press=0;
										control_panel_pram.A_press=0;
										control_panel_pram.B_press=0;									
									}break;
									case 23:                                            //Y轴按钮触发
									{
										SetButtonValue(2,23,1);        //Y轴保持选中状态
										TIM_Cmd(TIM4, ENABLE);         //启动TIM4定时器
										if(control_panel_pram.Y_press==0)
										{
											 TIM4->CNT = control_panel_pram.Y_Pulses_counter*4;
                       Pulses_counter=0;											
										}
										control_panel_pram.X_press=0;
										control_panel_pram.Y_press=1;
										control_panel_pram.Z_press=0;
										control_panel_pram.A_press=0;
										control_panel_pram.B_press=0;
							
									}break;
									case 24:                                              //Z轴按钮触发
									{
										SetButtonValue(2,24,1);         //Z轴保持选中状态
										TIM_Cmd(TIM4, ENABLE);          //启动TIM4定时器
										if(control_panel_pram.Z_press==0)
										{
											TIM4->CNT = control_panel_pram.Z_Pulses_counter*4;
                      Pulses_counter=0;											
										}
										control_panel_pram.X_press=0;
										control_panel_pram.Y_press=0;
										control_panel_pram.Z_press=1;
										control_panel_pram.A_press=0;
										control_panel_pram.B_press=0;						
									}break;
									case 25:                                             //A轴按钮触发
									{
										SetButtonValue(2,25,1);         //A轴保持选中状态
										TIM_Cmd(TIM4, ENABLE);          //启动TIM4定时器
										if(control_panel_pram.A_press==0)
										{
											TIM4->CNT = control_panel_pram.A_Pulses_counter*4;	
                      Pulses_counter=0;											
										}
										control_panel_pram.X_press=0;
										control_panel_pram.Y_press=0;
										control_panel_pram.Z_press=0;
										control_panel_pram.A_press=1;
										control_panel_pram.B_press=0;						
									}break;
									case 26:                                           //B轴按钮触发
									{
										  SetButtonValue(2,26,1);     //B轴保持选中状态
											TIM_Cmd(TIM4, ENABLE);      //启动TIM4定时器
											if(control_panel_pram.B_press==0)
											{
												TIM4->CNT = control_panel_pram.B_Pulses_counter*4;
                        Pulses_counter=0;												
											}
											control_panel_pram.X_press=0;
											control_panel_pram.Y_press=0;
											control_panel_pram.Z_press=0;
											control_panel_pram.A_press=0;
											control_panel_pram.B_press=1;
									}break;
									default:break;				
							}
					}break;
					case 3:                                        //画面3：回工件零页面
					{
						Work_Page_Status=Return_WorkPiece_Zero_Page;
						if(state.Work_state==Stop)    //停止加工状态
						{
							switch(get_control_id)                                
							{
									case 1:                           //全轴按钮触发
									{
										if(get_button_state)            //按钮是按下状态  
										{
											return_workpiece.all_spindle=1; //此时全轴按钮按下，XYZAB轴显示成没有选中状态
											SetButtonValue(3,4,1);
											SetButtonValue(3,5,1);
											SetButtonValue(3,6,1);
											SetButtonValue(3,7,1);
											SetButtonValue(3,8,1);
											return_workpiece.Re_X=1;
											return_workpiece.Re_Y=1;
											return_workpiece.Re_Z=1;
											return_workpiece.Re_A=1;
											return_workpiece.Re_B=1;										
										}
										else 
										{
											return_workpiece.all_spindle=0;
											return_workpiece.Re_X=0;
											return_workpiece.Re_Y=0;
											return_workpiece.Re_Z=0;
											return_workpiece.Re_A=0;
											return_workpiece.Re_B=0;
											
