pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c
										}
									
									}break;
									case 2:                           //取消按钮触发
									{
										control_panel_pram.X_value=return_workpiece.Re_X_Value;
										control_panel_pram.Y_value=return_workpiece.Re_Y_Value;
										control_panel_pram.Z_value=return_workpiece.Re_Z_Value;
										control_panel_pram.A_value=return_workpiece.Re_A_Value;
										control_panel_pram.B_value=return_workpiece.Re_B_Value;
									
									}break;
									case 3:                           //确定按钮触发
									{
										if(get_button_state) 
										{
											if(return_workpiece.Re_X==0)
											{
												control_panel_pram.X_value=0;
											}
											if(return_workpiece.Re_Y==0)
											{
												control_panel_pram.Y_value=0;
											}
											if(return_workpiece.Re_Z==0)
											{
												control_panel_pram.Z_value=0;
											}
											if(return_workpiece.Re_A==0)
											{
												control_panel_pram.A_value=0;
											}
											if(return_workpiece.Re_B==0)
											{
												control_panel_pram.B_value=0;
											}
												
										
										}
									
									}break;
									case 4:                           //X轴按钮触发
									{
										if(get_button_state) 						
										  return_workpiece.Re_X=1;
										else
										{
											return_workpiece.Re_X=0;
											return_workpiece.all_spindle=0;
										}
									
									}break;
									case 5:                           //Y轴按钮触发
									{
										if(get_button_state) 						
										  return_workpiece.Re_Y=1;
										else
										{
											return_workpiece.Re_Y=0;
											return_workpiece.all_spindle=0;
										}
									
									}break;
									case 6:                           //Z轴按钮触发
									{
										if(get_button_state) 						
										  return_workpiece.Re_Z=1;
										else
										{
											return_workpiece.Re_Z=0;
											return_workpiece.all_spindle=0;
										}
									
									}break;
									case 7:                           //A轴按钮触发
									{
										if(get_button_state) 						
										  return_workpiece.Re_A=1;
										else
										{
											return_workpiece.Re_A=0;
											return_workpiece.all_spindle=0;
										}
									
									}break;
									case 8:                           //B轴按钮触发
									{
										if(get_button_state)
										{											
										  return_workpiece.Re_B=1;
										}
										else
										{
											return_workpiece.Re_B=0;
                      return_workpiece.all_spindle=0;											
										}											
									}break;
									case 9:
									{
									  return_workpiece.Re_X_Value=control_panel_pram.X_value;
										control_panel_pram.X_value=NotifyText(msg->param);
										
									}break;
									case 10:
									{
									  return_workpiece.Re_Y_Value=control_panel_pram.Y_value;
										control_panel_pram.Y_value=NotifyText(msg->param);
									}break;
									case 11:
									{
									  return_workpiece.Re_Z_Value=control_panel_pram.Z_value;
										control_panel_pram.Z_value=NotifyText(msg->param);
									}break;
									case 12:
									{
									   return_workpiece.Re_A_Value=control_panel_pram.A_value;
										control_panel_pram.A_value=NotifyText(msg->param);
									}break;
									case 13:
									{
									   return_workpiece.Re_B_Value=control_panel_pram.B_value;
										control_panel_pram.B_value=NotifyText(msg->param);
									}break;
									default:break;
							}
						}
						else
						{
						
						}
					}break; 
					case 5: Work_Page_Status=Jump_Work_Page;break;              //画面5
					case 6:                                                     //画面6
					{
						Work_Page_Status=File_Manage_Page;
						switch(get_control_id)
						{
							case 1: Work_Page_Status=Leading_In_Page;break;
							case 2: Work_Page_Status=Leading_Out_Pgae;break;
							case 3: Work_Page_Status=Delete_Page;break;
							case 4: Work_Page_Status=Storage_View_Page;break;
							case 5: Work_Page_Status=Working_Page;break;
							case 18:Work_Page_Status=Working_Page;break;
							case 19:Work_Page_Status=Net_Account_Manage_Page;break;
							default:break;
						}
					}break;
					case 7: Work_Page_Status=Leading_In_Page;break;            //画面7
					case 9: Work_Page_Status=Delete_Page;break;                //画面8
					case 10: Work_Page_Status=Storage_View_Page;break;         //画面10
					case 11:                                                   //画面10
					{
						Work_Page_Status=Net_Account_Manage_Page;
						switch(get_control_id)
						{
							case 1: Work_Page_Status=Working_Page;break;
							case 2: Work_Page_Status=File_Manage_Page;break;
							case 3: Work_Page_Status=Choose_WiFi_Page;break;
							default:break;
						}
					}break;
					case 12: Work_Page_Status=Choose_WiFi_Page;break;
					case 13: Work_Page_Status=Disconnet_and_SignIn_Page;break;
					case 14: Work_Page_Status=Disconnect_and_SignOut_Page;break;
					case 15: Work_Page_Status=Disconnect_Remind_Page;break;
					case 16: Work_Page_Status=SignOut_Remind_Page;break;
					case 20: Work_Page_Status=Leading_Out_Pgae;break;
					case 21:                                                  //画面21
					{
						Work_Page_Status=Save_Pram_Page;
						if(state.Work_state==Stop)    //停止加工状态
						{
								switch(get_control_id)
								{
									case 1:    //确定按钮触发
									{							
										pram_status.Screen_ID21_Setting_Sure=1;
										pram_status.Screen_ID21_Setting_concel=0;
									}break;
									case 2:   //取消按钮触发
									{
										pram_status.Screen_ID21_Setting_Sure=0;
										pram_status.Screen_ID21_Setting_concel=1;						
									}
									default: break;	
								}
					  }
					}break;
					default: break;						
  			}
        
     }
		 
}


/*! 
*  \brief  文本控件通知
*  \details  当文本通过键盘更新(或调用GetControlValue)时，执行此函数
*  \details  文本控件的内容以字符串形式下发到MCU，如果文本控件内容是浮点值，
*  \details  则需要在此函数中将下发字符串重新转回浮点值。
*  \param str 文本控件内容
*  \pram  value 存放文本内容
*/
float NotifyText(uint8 *str)
{                                                                          
		float value=0;                                                            
		sscanf((char *)str,"%f",&value);            
     return  value;                                                                      
}                                                                                

